Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: قل إني نهيت أن أعبد الذين تدعون من دون الله لما جاءني البينات من ربي وأمرت أن أسلم لرب العالمين
en: Say (O Muhammad صلى الله عليه وسلم): "I have been forbidden to worship those whom you worship besides Allah, since there have come to me evidence from my Lord; and I am commanded to submit (in Islam) to the Lord of the 'Alamin (mankind, jinn and all that exists).

source: هو الذي خلقكم من تراب ثم من نطفة ثم من علقة ثم يخرجكم طفلا ثم لتبلغوا أشدكم ثم لتكونوا شيوخا ومنكم من يتوفى من قبل ولتبلغوا أجلا مسمى ولعلكم تعقلون
en: It is He, Who has created you (Adam) from dust, then from a Nutfah [mixed semen drops of male and female sexual discharge (i.e. Adam's offspring)] then from a clot (a piece of coagulated blood), then brings you forth as an infant, then (makes you grow) to reach the age of full strength, and afterwards to be old (men and women)- though some among you die before,- and that you reach an appointed term in order that you may understand.

source: هو الذي يحيي ويميت فإذا قضى أمرا فإنما يقول له كن فيكون
en: It is He Who gives life and causes death. And when He decides upon a thing He says to it only: "Be!" - and it is.

source: ألم تر إلى الذين يجادلون في آيات الله أنى يصرفون
en: See you not those who dispute about the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah? How are they turning away [from the truth, (i.e. Islamic Monotheism to the falsehood (i.e. polytheism)]?

source: الذين كذبوا بالكتاب وبما أرسلنا به رسلنا فسوف يعلمون
en: Those who deny the Book (this Qur'an), and that with which We sent Our Messengers (i.e. to worship none but Allah Alone sincerely, and to reject all false deities and to confess resurrection after the death for recompense) they will come to know (when they will be cast into the Fire of Hell).

source: إذ الأغلال في أعناقهم والسلاسل يسحبون
en: When iron collars will be rounded over their necks, and the chains, they shall be dragged along,

source: في الحميم ثم في النار يسجرون
en: In the boiling water, then they will be burned in the Fire.

source: ثم قيل لهم أين ما كنتم تشركون
en: Then it will be said to them: "Where are (all) those whom you used to join in worship as partners

source: من دون الله قالوا ضلوا عنا بل لم نكن ندعو من قبل شيئا كذلك يضل الله الكافرين
en: "Besides Allah"? They will say: "They have vanished from us: Nay, we did not invoke (worship) anything before." Thus Allah leads astray the disbelievers.

source: ذلكم بما كنتم تفرحون في الأرض بغير الحق وبما كنتم تمرحون
en: That was because you had been exulting in the earth without any right (by worshipping others instead of Allah and by committing crimes), and that you used to rejoice extremely (in your error).

source: ادخلوا أبواب جهنم خالدين فيها فبئس مثوى المتكبرين
en: Enter the gates of Hell to abide therein: and (indeed) what an evil abode of the arrogant!

source: فاصبر إن وعد الله حق فإما نرينك بعض الذي نعدهم أو نتوفينك فإلينا يرجعون
en: So be patient (O Muhammad صلى الله عليه وسلم); verily, the Promise of Allah is true and whether We show you (O Muhammad صلى الله عليه وسلم in this world) some part of what We have promised them, or We cause you to die then still it is to Us they all shall be returned.

source: ولقد أرسلنا رسلا من قبلك منهم من قصصنا عليك ومنهم من لم نقصص عليك وما كان لرسول أن يأتي بآية إلا بإذن الله فإذا جاء أمر الله قضي بالحق وخسر هنالك المبطلون
en: And, indeed We have sent Messengers before you (O Muhammad صلى الله عليه وسلم): of some of them We have related to you their story. And of some We have not related to you their story, and it was not given to any Messenger that he should bring a sign except by the Leave of Allah. But, when comes the Commandment of Allah, the matter will be decided with truth, and the followers of falsehood will then be lost.

source: الله الذي جعل لكم الأنعام لتركبوا منها ومنها تأكلون
en: Allah, it is He Who has made cattle for you, that you may ride on some of them, and of some you eat.

source: ولكم فيها منافع ولتبلغوا عليها حاجة في صدوركم وعليها وعلى الفلك تحملون
en: And you have (many other) benefits from them, and that you may reach by their means a desire that is in your breasts (i.e. carry your goods, loads, etc.), and on them and on ships you are carried.

source: ويريكم آياته فأي آيات الله تنكرون
en: And He shows you His Ayat (signs and proofs) (of His Oneness in all the above-mentioned things). Which, then of the Ayat (signs and proofs) of Allah do you deny?

source: أفلم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم كانوا أكثر منهم وأشد قوة وآثارا في الأرض فما أغنى عنهم ما كانوا يكسبون
en: Have they not travelled through the earth and seen what was the end of those before them? They were more in number than them and mightier in strength, and in the traces (they have left behind them) in the land; yet all that they used to earn availed them not.

source: فلما جاءتهم رسلهم بالبينات فرحوا بما عندهم من العلم وحاق بهم ما كانوا به يستهزئون
en: Then when their Messengers came to them with clear proofs, they were glad (and proud) with that which they had of the knowledge (of worldly things). And that at which they used to mock, surrounded them (i.e. the punishment).

source: فلما رأوا بأسنا قالوا آمنا بالله وحده وكفرنا بما كنا به مشركين
en: So when they saw Our punishment, they said: "We believe in Allah Alone and reject (all) that we used to associate with Him as (His) partners.

source: فلم يك ينفعهم إيمانهم لما رأوا بأسنا سنت الله التي قد خلت في عباده وخسر هنالك الكافرون
en: Then their Faith (in Islamic Monotheism) could not avail them when they saw Our punishment. (Like) this has been the way of Allah in dealing with His slaves. And there the disbelievers lost utterly (when Our Torment covered them).

source: تنزيل من الرحمن الرحيم
en: A revelation from (Allah), the Most Gracious, the Most Merciful.

source: كتاب فصلت آياته قرآنا عربيا لقوم يعلمون
en: A Book whereof the Verses are explained in detail - a Qur'an in Arabic for people who know.

source: بشيرا ونذيرا فأعرض أكثرهم فهم لا يسمعون
en: Giving glad tidings [of Paradise to the one who believes in the Oneness of Allah (i.e. Islamic Monotheism) and fears Allah much (abstains from all kinds of sins and evil deeds) and loves Allah much (performing all kinds of good deeds which He has ordained)], and warning (of punishment in the Hell-Fire to the one who disbelieves in the Oneness of Allah), but most of them turn away, so they hear not.

source: وقالوا قلوبنا في أكنة مما تدعونا إليه وفي آذاننا وقر ومن بيننا وبينك حجاب فاعمل إننا عاملون
en: And they say: "Our hearts are under coverings (screened) from that to which you invite us; and in our ears is deafness, and between us and you is a screen: so work you (on your way); verily, we are working (on our way)."

source: قل إنما أنا بشر مثلكم يوحى إلي أنما إلهكم إله واحد فاستقيموا إليه واستغفروه وويل للمشركين
en: Say (O Muhammad صلى الله عليه وسلم): "I am only a human being like you. It is revealed to me that your Ilah (God) is One Ilah (God - Allah), therefore take Straight Path to Him (with true Faith - Islamic Monotheism) and obedience to Him, and seek forgiveness of Him. And woe to Al-Mushrikun (the polytheists, idolaters, disbelievers in the Oneness of Allah).

source: الذين لا يؤتون الزكاة وهم بالآخرة هم كافرون
en: Those who give not the Zakat and they are disbelievers in the Hereafter.

source: إن الذين آمنوا وعملوا الصالحات لهم أجر غير ممنون
en: Truly, those who believe (in the Oneness of Allah, and in His Messenger Muhammad صلى الله عليه وسلم - Islamic Monotheism) and do righteous good deeds, for them will be an endless reward that will never stop (i.e. Paradise).

source: قل أئنكم لتكفرون بالذي خلق الأرض في يومين وتجعلون له أندادا ذلك رب العالمين
en: Say (O Muhammad صلى الله عليه وسلم): "Do you verily disbelieve in Him Who created the earth in two Days? And you set up rivals (in worship) with Him? That is the Lord of the 'Alamin (mankind, jinn and all that exists).

source: وجعل فيها رواسي من فوقها وبارك فيها وقدر فيها أقواتها في أربعة أيام سواء للسائلين
en: He placed therein (i.e. the earth) firm mountains from above it, and He blessed it, and measured therein its sustenance (for its dwellers) in four Days equal (i.e. all these four days were equal in the length of time) for all those who ask (about its creation).

source: ثم استوى إلى السماء وهي دخان فقال لها وللأرض ائتيا طوعا أو كرها قالتا أتينا طائعين
en: Then He rose over (Istawa) towards the heaven when it was smoke, and said to it and to the earth: "Come both of you willingly or unwillingly." They both said: "We come willingly."

source: فقضاهن سبع سماوات في يومين وأوحى في كل سماء أمرها وزينا السماء الدنيا بمصابيح وحفظا ذلك تقدير العزيز العليم
en: Then He completed and finished from their creation (as) seven heavens in two Days and He made in each heaven its affair. And We adorned the nearest (lowest) heaven with lamps (stars) to be an adornment as well as to guard (from the devils by using them as missiles against the devils). Such is the Decree of Him the All-Mighty, the All-Knower.

source: فإن أعرضوا فقل أنذرتكم صاعقة مثل صاعقة عاد وثمود
en: But if they turn away, then say (O Muhammad صلى الله عليه وسلم): "I have warned you of a Sa'iqah (a destructive awful cry, torment, hit, a thunderbolt) like the Sa'iqah which overtook 'Ad and Thamud (people)."

source: إذ جاءتهم الرسل من بين أيديهم ومن خلفهم ألا تعبدوا إلا الله قالوا لو شاء ربنا لأنزل ملائكة فإنا بما أرسلتم به كافرون
en: When the Messengers came to them, from before them and behind them (saying): "Worship none but Allah", they said: "If our Lord had so willed, He would surely have sent down the angels. So indeed we disbelieve in that with which you have been sent."

source: فأما عاد فاستكبروا في الأرض بغير الحق وقالوا من أشد منا قوة أولم يروا أن الله الذي خلقهم هو أشد منهم قوة وكانوا بآياتنا يجحدون
en: As for 'Ad, they were arrogant in the land without right, and they said: "Who is mightier than us in strength?" See they not that Allah, Who created them was mightier in strength than them. And they used to deny Our Ayat (proofs, evidence, verses, lessons, revelations, etc.)!

source: فأرسلنا عليهم ريحا صرصرا في أيام نحسات لنذيقهم عذاب الخزي في الحياة الدنيا ولعذاب الآخرة أخزى وهم لا ينصرون
en: So We sent upon them a furious wind in days of evil omen (for them) that We might give them a taste of disgracing torment in this present worldly life. But surely the torment of the Hereafter will be more disgracing, and they will never be helped.

source: وأما ثمود فهديناهم فاستحبوا العمى على الهدى فأخذتهم صاعقة العذاب الهون بما كانوا يكسبون
en: And as for Thamud, We showed and made clear to them the Path of Truth (Islamic Monotheism) through Our Messenger, (i.e. showed them the way of success), but they preferred blindness to guidance; so the Sa'iqah (a destructive awful cry, torment, hit, a thunderbolt) of disgracing torment seized them because of what they used to earn.

source: ونجينا الذين آمنوا وكانوا يتقون
en: And We saved those who believed and used to fear Allah, keep their duty to Him and avoid evil.

source: ويوم يحشر أعداء الله إلى النار فهم يوزعون
en: And (remember) the Day that the enemies of Allah will be gathered to the Fire, then they will be driven [(to the Fire), former ones being withheld till their later ones will join them].

source: حتى إذا ما جاءوها شهد عليهم سمعهم وأبصارهم وجلودهم بما كانوا يعملون
en: Till, when they reach it (Hell-fire), their hearing (ears) and their eyes, and their skins will testify against them as to what they used to do.

source: وقالوا لجلودهم لم شهدتم علينا قالوا أنطقنا الله الذي أنطق كل شيء وهو خلقكم أول مرة وإليه ترجعون
en: And they will say to their skins, "Why do you testify against us?" They will say: "Allah has caused us to speak as He causes all things to speak: and He created you the first time, and to Him you are made to return."

source: وما كنتم تستترون أن يشهد عليكم سمعكم ولا أبصاركم ولا جلودكم ولكن ظننتم أن الله لا يعلم كثيرا مما تعملون
en: And you have not been hiding yourselves (in the world), lest your ears, and your eyes, and your skins should testify against you; but you thought that Allah knew not much of what you were doing.

source: وذلكم ظنكم الذي ظننتم بربكم أرداكم فأصبحتم من الخاسرين
en: And that thought of yours which you thought about your Lord, has brought you to destruction; and you have become (this Day) of those utterly lost!

source: فإن يصبروا فالنار مثوى لهم وإن يستعتبوا فما هم من المعتبين
en: Then, if they bear the torment patiently, then the Fire is the home for them, and if they seek to please Allah, yet they are not of those who will ever be allowed to please Allah.

source: وقيضنا لهم قرناء فزينوا لهم ما بين أيديهم وما خلفهم وحق عليهم القول في أمم قد خلت من قبلهم من الجن والإنس إنهم كانوا خاسرين
en: And We have assigned for them (devils) intimate companions (in this world), who have made fair-seeming to them, what was before them (evil deeds which they were doing in the present worldly life and disbelief in the Reckoning and the Resurrection) and what was behind them (denial of the matters in the coming life of the Hereafter as regards punishment or reward). And the Word (i.e. the torment) is justified against them as it was justified against those who were among the previous generations of jinn and men that had passed away before them. Indeed they (all) were the losers.

source: وقال الذين كفروا لا تسمعوا لهذا القرآن والغوا فيه لعلكم تغلبون
en: And those who disbelieve say: "Listen not to this Qur'an, and make noise in the midst of its (recitation) that you may overcome."

source: فلنذيقن الذين كفروا عذابا شديدا ولنجزينهم أسوأ الذي كانوا يعملون
en: But surely, We shall cause those who disbelieve to taste a severe torment, and certainly, We shall requite them the worst of what they used to do.

source: ذلك جزاء أعداء الله النار لهم فيها دار الخلد جزاء بما كانوا بآياتنا يجحدون
en: That is the recompense of the enemies of Allah: the Fire. Therein will be for them the eternal home, a (deserving) recompense for that they used to deny Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.).

source: وقال الذين كفروا ربنا أرنا اللذين أضلانا من الجن والإنس نجعلهما تحت أقدامنا ليكونا من الأسفلين
en: And those who disbelieve will say: "Our Lord! Show us those among jinn and men who led us astray: that we may crush them under our feet so that they become the lowest."

source: إن الذين قالوا ربنا الله ثم استقاموا تتنزل عليهم الملائكة ألا تخافوا ولا تحزنوا وأبشروا بالجنة التي كنتم توعدون
en: Verily, those who say: "Our Lord is Allah (Alone)," and then they stand firm, on them the angels will descend (at the time of their death) (saying): "Fear not, nor grieve! But receive the glad tidings of Paradise which you have been promised!

source: نحن أولياؤكم في الحياة الدنيا وفي الآخرة ولكم فيها ما تشتهي أنفسكم ولكم فيها ما تدعون
en: "We have been your friends in the life of this world and are (so) in the Hereafter. Therein you shall have (all) that your inner-selves desire, and therein you shall have (all) for which you ask.

source: نزلا من غفور رحيم
en: "An entertainment from (Allah), the Oft-Forgiving, Most Merciful."

source: ومن أحسن قولا ممن دعا إلى الله وعمل صالحا وقال إنني من المسلمين
en: And who is better in speech than he who [says: "My Lord is Allah (believes in His Oneness)," and then stands firm (acts upon His Order), and] invites (men) to Allah's (Islamic Monotheism), and does righteous deeds, and says: "I am one of the Muslims."

source: ولا تستوي الحسنة ولا السيئة ادفع بالتي هي أحسن فإذا الذي بينك وبينه عداوة كأنه ولي حميم
en: The good deed and the evil deed cannot be equal. Repel (the evil) with one which is better (i.e. Allah orders the faithful believers to be patient at the time of anger, and to excuse those who treat them badly) then verily he, between whom and you there was enmity, (will become) as though he was a close friend.

source: وما يلقاها إلا الذين صبروا وما يلقاها إلا ذو حظ عظيم
en: But none is granted it (the above quality) except those who are patient - and none is granted it except the owner of the great portion (of happiness in the Hereafter i.e. Paradise and of a high moral character) in this world.

source: وإما ينزغنك من الشيطان نزغ فاستعذ بالله إنه هو السميع العليم
en: And if an evil whisper from Shaitan (Satan) tries to turn you away (O Muhammad صلى الله عليه وسلم) (from doing good), then seek refuge in Allah. Verily, He is the All-Hearer, the All-Knower.

source: ومن آياته الليل والنهار والشمس والقمر لا تسجدوا للشمس ولا للقمر واسجدوا لله الذي خلقهن إن كنتم إياه تعبدون
en: And from among His Signs are the night and the day, and the sun and the moon. Prostrate yourselves not to the sun nor to the moon, but prostrate yourselves to Allah Who created them, if you (really) worship Him.

source: فإن استكبروا فالذين عند ربك يسبحون له بالليل والنهار وهم لا يسأمون
en: But if they are too proud (to do so), then there are those who are with your Lord (angels) glorify Him night and day, and never are they tired.

source: ومن آياته أنك ترى الأرض خاشعة فإذا أنزلنا عليها الماء اهتزت وربت إن الذي أحياها لمحيي الموتى إنه على كل شيء قدير
en: And among His Signs (in this), that you see the earth barren; but when We send down water (rain) to it, it is stirred to life and growth (of vegetations). Verily, He Who gives it life, surely, is Able to give life to the dead (on the Day of Resurrection). Indeed He is Able to do all things.

source: إن الذين يلحدون في آياتنا لا يخفون علينا أفمن يلقى في النار خير أم من يأتي آمنا يوم القيامة اعملوا ما شئتم إنه بما تعملون بصير
en: Verily, those who turn away from Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc. by attacking, distorting and denying them) are not hidden from Us. Is he who is cast into the Fire better or he who comes secure on the Day of Resurrection? Do what you will. Verily He is All-Seer of what you do (this is a severe threat to the disbelievers ).

source: إن الذين كفروا بالذكر لما جاءهم وإنه لكتاب عزيز
en: Verily, those who disbelieved in the Reminder (i.e. the Qur'an) when it came to them (shall receive the punishment). And verily, it is an honourable well-fortified respected Book (because it is Allah's Speech, and He has protected it from corruption. (See V.15:9)

source: لا يأتيه الباطل من بين يديه ولا من خلفه تنزيل من حكيم حميد
en: Falsehood cannot come to it from before it or behind it: (it is) sent down by the All-Wise, Worthy of all praise (Allah عز وجل).

source: ما يقال لك إلا ما قد قيل للرسل من قبلك إن ربك لذو مغفرة وذو عقاب أليم
en: Nothing is said to you (O Muhammad صلى الله عليه وسلم) except what was said to the Messengers before you. Verily, your Lord is the Possessor of Forgiveness, and (also) the Possessor of Painful Punishment.

source: ولو جعلناه قرآنا أعجميا لقالوا لولا فصلت آياته أأعجمي وعربي قل هو للذين آمنوا هدى وشفاء والذين لا يؤمنون في آذانهم وقر وهو عليهم عمى أولئك ينادون من مكان بعيد
en: And if We had sent this as a Qur'an in a foreign language (other than Arabic), they would have said: "Why are not its verses explained in detail (in our language)? What! (A Book) not in Arabic and (the Messenger) an Arab?" Say: "It is for those who believe, a guide and a healing. And as for those who disbelieve, there is heaviness (deafness) in their ears, and it (the Qur'an) is blindness for them. They are those who are called from a place far away (so they neither listen nor understand)."

source: من عمل صالحا فلنفسه ومن أساء فعليها وما ربك بظلام للعبيد
en: Whosoever does righteous good deed, it is for (the benefit of) his ownself; and whosoever does evil, it is against his ownself. And your Lord is not at all unjust to (His) slaves.

source: إليه يرد علم الساعة وما تخرج من ثمرات من أكمامها وما تحمل من أنثى ولا تضع إلا بعلمه ويوم يناديهم أين شركائي قالوا آذناك ما منا من شهيد
en: To Him (Alone) is referred the knowledge of the Hour. No fruit comes out of its sheath, nor does a female conceive nor brings forth (young), except by His Knowledge. And on the Day when He will call unto them (polytheists) (saying): "Where are My (so-called) partners (whom you did invent)?" They will say: "We inform You that none of us bears witness to it (that they are Your partners)!"

source: وضل عنهم ما كانوا يدعون من قبل وظنوا ما لهم من محيص
en: And those whom they used to invoke before (in this world) shall disappear from them, and they will perceive that they have no place of refuge (from Allah's punishment).

source: لا يسأم الإنسان من دعاء الخير وإن مسه الشر فيئوس قنوط
en: Man (the disbeliever) does not get tired of asking good (things from Allah); but if an evil touches him, then he gives up all hope and is lost in despair.

source: ولئن أذقناه رحمة منا من بعد ضراء مسته ليقولن هذا لي وما أظن الساعة قائمة ولئن رجعت إلى ربي إن لي عنده للحسنى فلننبئن الذين كفروا بما عملوا ولنذيقنهم من عذاب غليظ
en: And truly, if We give him a taste of mercy from Us, after some adversity (severe poverty or disease, etc.) has touched him, he is sure to say: "This is due to my (merit); I think not that the Hour will be established. But if I am brought back to my Lord, surely, there will be for me the best (wealth) with Him. Then, We verily, will show to the disbelievers what they have done, and We shall make them taste a severe torment.

source: وإذا أنعمنا على الإنسان أعرض ونأى بجانبه وإذا مسه الشر فذو دعاء عريض
en: And when We show favour to man, he withdraws and turns away; but when evil touches him, then he has recourse to long supplications.

source: قل أرأيتم إن كان من عند الله ثم كفرتم به من أضل ممن هو في شقاق بعيد
en: Say: "Tell me, if it (the Qur'an) is from Allah, and you disbelieve in it? Who is more astray than one who is in opposition far away (from Allah's Right Path and His obedience).

source: سنريهم آياتنا في الآفاق وفي أنفسهم حتى يتبين لهم أنه الحق أولم يكف بربك أنه على كل شيء شهيد
en: We will show them Our Signs in the universe, and in their own selves, until it becomes manifest to them that this (the Qur'an) is the truth. Is it not sufficient in regard to your Lord that He is a Witness over all things?

source: ألا إنهم في مرية من لقاء ربهم ألا إنه بكل شيء محيط
en: Verily they are in doubt concerning the Meeting with their Lord? (i.e. Resurrection after their death, and their return to their Lord). Verily! He it is Who is surrounding all things!

source: عسق
en: 'Ain-Sin-Qaf. [These letters are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings].

source: كذلك يوحي إليك وإلى الذين من قبلك الله العزيز الحكيم
en: Likewise Allah, the All-Mighty, the All-Wise sends Revelation to you (O Muhammad صلى الله عليه و سلم) as (He sent Revelation to) those before you.

source: له ما في السماوات وما في الأرض وهو العلي العظيم
en: To Him belongs all that is in the heavens and all that is in the earth, and He is the Most High, the Most Great.

source: تكاد السماوات يتفطرن من فوقهن والملائكة يسبحون بحمد ربهم ويستغفرون لمن في الأرض ألا إن الله هو الغفور الرحيم
en: Nearly the heavens might be rent asunder from above them (by His Majesty): and the angels glorify the praises of their Lord, and ask for forgiveness for those on the earth. Verily, Allah is the Oft-Forgiving, the Most Merciful.

source: والذين اتخذوا من دونه أولياء الله حفيظ عليهم وما أنت عليهم بوكيل
en: And as for those who take as Auliya' (guardians, supporters, helpers, lords, gods, protectors) others besides Him [i.e. they take false deities other than Allah as protectors, and they worship them] - Allah is Hafiz (Protector, Watcher) over them (i.e. takes care of their deeds and will recompense them), and you (O Muhammad صلى الله عليه و سلم) are not a Wakil (guardian or a disposer of their affairs) over them (to protect their deeds).
